ГТС/УТГТС/DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/Catalogs/УпаковкиЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УпаковкиЕдиницыИзмерения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НаборыУпаковок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Безразмерная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Числитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныеРазмерыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеГруппыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляетсяВМногооборотнойТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличествоУпаковокМногооборотнойТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзмеряемойВеличины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУпаковокНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/МобильноеРабочееМестоКладовщика/Forms/РедактированиеТовара/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВесЕдиницаИзмеренияНажатие(Элемент, СтандартнаяОбработка)
	ЕдиницаИзмеренияНажатие("ВесЕдиницаИзмерения", СтандартнаяОбработка, "Вес");
КонецПроцедуры

&НаКлиенте
Процедура ОбъемЕдиницаИзмеренияНажатие(Элемент, СтандартнаяОбработка)
	ЕдиницаИзмеренияНажатие("ОбъемЕдиницаИзмерения", СтандартнаяОбработка, "Объем");
КонецПроцедуры

&НаКлиенте
Процедура ДлинаЕдиницаИзмеренияНажатие(Элемент, СтандартнаяОбработка)
	ЕдиницаИзмеренияНажатие("ДлинаЕдиницаИзмерения", СтандартнаяОбработка, "Длина");
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьЕдиницаИзмеренияНажатие(Элемент, СтандартнаяОбработка)
	ЕдиницаИзмеренияНажатие("ПлощадьЕдиницаИзмерения", СтандартнаяОбработка, "Площадь");
КонецПроцедуры

&НаКлиенте
Процедура ВесЧислительПриИзменении(Элемент)
	УстановитьЕдиницуИзмеренияПоУмолчанию("Вес");
КонецПроцедуры

&НаКлиенте
Процедура ОбъемЧислительПриИзменении(Элемент)
	УстановитьЕдиницуИзмеренияПоУмолчанию("Объем");
КонецПроцедуры

&НаКлиенте
Процедура ДлинаЧислительПриИзменении(Элемент)
	УстановитьЕдиницуИзмеренияПоУмолчанию("Длина");
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьЧислительПриИзменении(Элемент)
	УстановитьЕдиницуИзмеренияПоУмолчанию("Площадь");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФорму()
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Номенклатура);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(НоменклатураОбъект, ЭтаФорма);
	
	Если НоменклатураОбъект.ВесЗнаменатель > 0 Тогда
		НоменклатураОбъект.ВесИспользовать = Истина;
	КонецЕсли;
	
	Если НоменклатураОбъект.ОбъемЗнаменатель > 0 Тогда
		НоменклатураОбъект.ОбъемИспользовать = Истина;
	КонецЕсли;
	
	Если НоменклатураОбъект.ДлинаЗнаменатель > 0 Тогда
		НоменклатураОбъект.ДлинаИспользовать = Истина;
	КонецЕсли;
	
	Если НоменклатураОбъект.ПлощадьЗнаменатель > 0 Тогда
		НоменклатураОбъект.ПлощадьИспользовать = Истина;
	КонецЕсли;
	
	НоменклатураОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияНажатие(ИмяПоля, СтандартнаяОбработка, ИмяМеры)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура("ИмяПоля, ИмяМеры", ИмяПоля, ИмяМеры);
	ОписаниеОповещения  = Новый ОписаниеОповещения("ЕдиницаИзмеренияНажатиеЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ИмяТипаИзмеряемойВеличины = "Перечисление.ТипыИзмеряемыхВеличин." + ИмяМеры;
	ТипИзмеряемойВеличины     = ПредопределенноеЗначение(ИмяТипаИзмеряемойВеличины);
	
	Отбор          = Новый Структура("ТипИзмеряемойВеличины", ТипИзмеряемойВеличины);
	ПараметрыФормы = Новый Структура("Отбор,ТекущаяСтрока", Отбор, ЭтаФорма[ИмяПоля]);
	
	ОткрытьФорму("Справочник.УпаковкиЕдиницыИзмерения.ФормаВыбора",
				ПараметрыФормы,
				ЭтотОбъект,
				,
				,
				,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Модифицированность = Истина;
		
		ЭтаФорма[ДополнительныеПараметры.ИмяПоля] = Результат;
	КонецЕсли;
	
	Мера = ДополнительныеПараметры.ИмяМеры;
	СвойстваМеры = СвойстваМеры(Мера);
	
	ТекстПредставленияЗначения = НСтр("ru = 'Можно указывать количество в %ЕдиницаИзмеренияМеры% в документах'");
	ТекстПредставленияЗначения = СтрЗаменить(ТекстПредставленияЗначения,
	"%ЕдиницаИзмеренияМеры%",
	Строка(ЭтаФорма[СвойстваМеры.ЕдиницаИзмерения]));
	
КонецПроцедуры

// Описание
// 
// Параметры:
// 	Мера - Строка -
// Возвращаемое значение:
// 	Структура - Содержит ключи:
// 		* Использовать - Строка -
// 		* ЕдиницаИзмерения - Строка -
// 		* Числитель - Строка -
// 		* Знаменатель - Строка -
// 		* МожноУказыватьВДокументах - Строка -
// 		* МожноУказыватьВДокументахСтрока - Строка -
// 		* Отступ - Строка -
// 		* Надпись - Строка -
&НаКлиентеНаСервереБезКонтекста
Функция СвойстваМеры(Мера)
	
	СвойстваМеры = Новый Структура;
	СвойстваМеры.Вставить("Использовать");
	СвойстваМеры.Вставить("ЕдиницаИзмерения");
	СвойстваМеры.Вставить("Числитель");
	СвойстваМеры.Вставить("Знаменатель");
	СвойстваМеры.Вставить("МожноУказыватьВДокументах");
	СвойстваМеры.Вставить("МожноУказыватьВДокументахСтрока");
	СвойстваМеры.Вставить("Отступ");
	СвойстваМеры.Вставить("Надпись");
	
	Если Мера = "Объем" Тогда
		СвойстваМеры.Использовать = "ОбъемИспользовать";
		СвойстваМеры.ЕдиницаИзмерения = "ОбъемЕдиницаИзмерения";
		СвойстваМеры.Числитель = "ОбъемЧислитель";
		СвойстваМеры.Знаменатель = "ОбъемЗнаменатель";
		СвойстваМеры.МожноУказыватьВДокументах = "ОбъемМожноУказыватьВДокументах";
		СвойстваМеры.МожноУказыватьВДокументахСтрока = "ОбъемМожноУказыватьВДокументахСтрока";
		СвойстваМеры.Отступ = "ОбъемОтступ";
		СвойстваМеры.Надпись = "ОбъемНадпись";
	ИначеЕсли Мера = "Длина" Тогда
		СвойстваМеры.Использовать = "ДлинаИспользовать";
		СвойстваМеры.ЕдиницаИзмерения = "ДлинаЕдиницаИзмерения";
		СвойстваМеры.Числитель = "ДлинаЧислитель";
		СвойстваМеры.Знаменатель = "ДлинаЗнаменатель";
		СвойстваМеры.МожноУказыватьВДокументах = "ДлинаМожноУказыватьВДокументах";
		СвойстваМеры.МожноУказыватьВДокументахСтрока = "ДлинаМожноУказыватьВДокументахСтрока";
		СвойстваМеры.Отступ = "ДлинаОтступ";
		СвойстваМеры.Надпись = "ДлинаНадпись";
	ИначеЕсли Мера = "Ширина" Тогда
		СвойстваМеры.Использовать = "ШиринаИспользовать";
		СвойстваМеры.ЕдиницаИзмерения = "ШиринаЕдиницаИзмерения";
		СвойстваМеры.Числитель = "ШиринаЧислитель";
		СвойстваМеры.Знаменатель = "ШиринаЗнаменатель";
		СвойстваМеры.МожноУказыватьВДокументах = "ШиринаМожноУказыватьВДокументах";
		СвойстваМеры.МожноУказыватьВДокументахСтрока = "ШиринаМожноУказыватьВДокументахСтрока";
		СвойстваМеры.Отступ = "ШиринаОтступ";
		СвойстваМеры.Надпись = "ШиринаНадпись";
	ИначеЕсли Мера = "Вес" Тогда
		СвойстваМеры.Использовать = "ВесИспользовать";
		СвойстваМеры.ЕдиницаИзмерения = "ВесЕдиницаИзмерения";
		СвойстваМеры.Числитель = "ВесЧислитель";
		СвойстваМеры.Знаменатель = "ВесЗнаменатель";
		СвойстваМеры.МожноУказыватьВДокументах = "ВесМожноУказыватьВДокументах";
		СвойстваМеры.МожноУказыватьВДокументахСтрока = "ВесМожноУказыватьВДокументахСтрока";
		СвойстваМеры.Отступ = "ВесОтступ";
		СвойстваМеры.Надпись = "ВесНадпись";
	ИначеЕсли Мера = "Площадь" Тогда
		СвойстваМеры.Использовать = "ПлощадьИспользовать";
		СвойстваМеры.ЕдиницаИзмерения = "ПлощадьЕдиницаИзмерения";
		СвойстваМеры.Числитель = "ПлощадьЧислитель";
		СвойстваМеры.Знаменатель = "ПлощадьЗнаменатель";
		СвойстваМеры.МожноУказыватьВДокументах = "ПлощадьМожноУказыватьВДокументах";
		СвойстваМеры.МожноУказыватьВДокументахСтрока = "ПлощадьМожноУказыватьВДокументахСтрока";
		СвойстваМеры.Отступ = "ПлощадьОтступ";
		СвойстваМеры.Надпись = "ПлощадьНадпись";
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не определены свойства меры %1'"), Мера);
	КонецЕсли;
	
	Возврат СвойстваМеры;
	
КонецФункции

&НаСервере
Процедура УстановитьЕдиницуИзмеренияПоУмолчанию(Мера)
	#Если НЕ МобильныйАвтономныйСервер Тогда
	Если ЭтаФорма[Мера + "ЕдиницаИзмерения"].Пустая() Тогда
		ЭтаФорма[Мера + "ЕдиницаИзмерения"] = НоменклатураСервер.ЕдиницаИзмеренияПоУмолчанию(Мера);
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

#КонецОбласти
